In [1]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [3]:
ser1=Series(np.arange(3),index=['A','B','C'])

ser1=2*ser1

ser1

A    0
B    2
C    4
dtype: int32

In [4]:
ser1['B']

2

In [5]:
ser1[2]

4

In [7]:
ser1['C']

4

In [9]:
ser1[:3]

A    0
B    2
C    4
dtype: int32

In [12]:
ser1[['A','B']]

A    0
B    2
dtype: int32

In [13]:
ser1[ser1>3]

C    4
dtype: int32

In [19]:
ser1[ser1 >= 2]=10
ser1

A     0
B    10
C    10
dtype: int32

In [22]:
dframe=DataFrame(np.arange(30).reshape(3,10),index=['A','B','C'],columns=['NY','WA','OR','CA','IL','MA','ME','DE','KE','TX'])

dframe

   NY  WA  OR  CA  IL  MA  ME  DE  KE  TX
A   0   1   2   3   4   5   6   7   8   9
B  10  11  12  13  14  15  16  17  18  19
C  20  21  22  23  24  25  26  27  28  29

In [26]:
#Display data frame by index
dframe.ix['B']

NY    10
WA    11
OR    12
CA    13
IL    14
MA    15
ME    16
DE    17
KE    18
TX    19
Name: B, dtype: int32

In [28]:
#Display Column

dframe['CA']

A     3
B    13
C    23
Name: CA, dtype: int32

In [29]:
#Dispslay Column where value is greater than 3
dframe[dframe['CA']>3]

   NY  WA  OR  CA  IL  MA  ME  DE  KE  TX
B  10  11  12  13  14  15  16  17  18  19
C  20  21  22  23  24  25  26  27  28  29

In [32]:
dframe[dframe['CA']>3]=10
dframe

   NY  WA  OR  CA  IL  MA  ME  DE  KE  TX
A   0   1   2   3   4   5   6   7   8   9
B  10  10  10  10  10  10  10  10  10  10
C  10  10  10  10  10  10  10  10  10  10

In [33]:
dframe

   NY  WA  OR  CA  IL  MA  ME  DE  KE  TX
A   0   1   2   3   4   5   6   7   8   9
B  10  10  10  10  10  10  10  10  10  10
C  10  10  10  10  10  10  10  10  10  10

In [34]:
dframe > 10

      NY     WA     OR     CA     IL     MA     ME     DE     KE     TX
A  False  False  False  False  False  False  False  False  False  False
B  False  False  False  False  False  False  False  False  False  False
C  False  False  False  False  False  False  False  False  False  False

In [35]:
dframe >= 10

      NY     WA     OR     CA     IL     MA     ME     DE     KE     TX
A  False  False  False  False  False  False  False  False  False  False
B   True   True   True   True   True   True   True   True   True   True
C   True   True   True   True   True   True   True   True   True   True

In [36]:
dframe.ix['C']

NY    10
WA    10
OR    10
CA    10
IL    10
MA    10
ME    10
DE    10
KE    10
TX    10
Name: C, dtype: int32